==================
Simple string key-value pair (unquoted)
==================
---
title: My Document
author: John Doe
---

---

(document
  (yaml_front_matter
    start: (yaml_front_matter_start)
    (yaml_mapping
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_string
            (yaml_string_unquoted))))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_string
            (yaml_string_unquoted)))))
    close: (yaml_front_matter_delimiter)))

==================
Quoted string values
==================
---
title: "Document with: special chars"
description: 'Single quoted string'
---

---

(document
  (yaml_front_matter
    start: (yaml_front_matter_start)
    (yaml_mapping
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_string
            (yaml_string_quoted))))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_string
            (yaml_string_quoted)))))
    close: (yaml_front_matter_delimiter)))

==================
Numeric values
==================
---
version: 1.2
count: 42
scientific: 1.5e-10
---

---

(document
  (yaml_front_matter
    start: (yaml_front_matter_start)
    (yaml_mapping
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_number)))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_number)))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_number))))
    close: (yaml_front_matter_delimiter)))

==================
Boolean values
==================
---
enabled: true
disabled: false
yes_value: yes
no_value: no
---

---

(document
  (yaml_front_matter
    start: (yaml_front_matter_start)
    (yaml_mapping
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_boolean)))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_boolean)))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_boolean)))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_boolean))))
    close: (yaml_front_matter_delimiter)))

==================
Null values
==================
---
empty1: null
empty2: ~
---

---

(document
  (yaml_front_matter
    start: (yaml_front_matter_start)
    (yaml_mapping
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_null)))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_null))))
    close: (yaml_front_matter_delimiter)))

==================
Empty YAML front matter
==================
---
---

---

(document
  (yaml_front_matter
    start: (yaml_front_matter_start)
    close: (yaml_front_matter_delimiter)))

==================
YAML with ... delimiter
==================
---
title: Document
...

---

(document
  (yaml_front_matter
    start: (yaml_front_matter_start)
    (yaml_mapping
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_string
            (yaml_string_unquoted)))))
    close: (yaml_front_matter_delimiter)))

==================
Empty value (key with no value)
==================
---
title:
author: Name
---

---

(document
  (yaml_front_matter
    start: (yaml_front_matter_start)
    (yaml_mapping
      (yaml_pair
        key: (yaml_key))
      (yaml_pair
        key: (yaml_key)
        value: (yaml_scalar
          (yaml_string
            (yaml_string_unquoted)))))
    close: (yaml_front_matter_delimiter)))
